app/Controllers/Admin/Categorias.php

    public function index(){
        $data = [
            'titulo' => 'Listando as categorias',
            'categorias' => $this->categoriaModel->withDeleted(true)->paginate(10),
---
SELECT *
FROM `categorias`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `categorias`