app/Controllers/Admin/Usuarios.php

    public function index(){

        //$usuario = service('autenticacao');

        $data = [
            'titulo'=> 'Listando os usuarios',
            'usuarios' => $this->usuarioModel->withDeleted(true)->paginate(2),
            'pager' =>  $this->usuarioModel->pager,
        ];
---
SELECT *
FROM `usuarios`
 LIMIT 4, 2
SELECT COUNT(*) AS `numrows`
FROM `usuarios`

    private function buscaUsuarioOu404(int $id = null){

        if(!$id || !$usuario = $this->usuarioModel->withDeleted(true)->where('id', $id)->first()){
---
SELECT *
FROM `usuarios`
WHERE `id` = 6
GROUP BY `usuarios`.`id`
ORDER BY `usuarios`.`id` ASC
 LIMIT 1